app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Here's a sample body."], ["created_at", "2015-12-21 22:15:21.863879"], ["title", "Hi again!"], ["updated_at", "2015-12-21 22:15:21.863879"]]
---
  def create
    @article = Article.new(article_params)
    @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "articles" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["image_content_type", "image/png"], ["image_file_name", "beast.png"], ["image_file_size", 27720], ["image_updated_at", "2015-12-22 04:25:47.938370"], ["updated_at", "2015-12-22 04:25:47.964983"]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)