app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.article_id = params[:article_id]
    @comment.save
---
INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 12], ["author_name", "Colin"], ["body", "A comment!"], ["created_at", "2015-12-21 23:47:02.990450"], ["updated_at", "2015-12-21 23:47:02.990450"]]